snlkuharlocal/src/Documents/ПланНабора/ПланНабора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланНабора</name>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Комплектация</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Накладная</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Режим</name>
    <comment>Левый-Правый</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяРНК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьНабратьСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьОтсканироватьСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьДопОбработатьСтрок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СозданоОбработкойПополнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроходнаяНакладная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьВПервуюОчередь</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательныйНабор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборМиксами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеконтролироватьСканированиеЧЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>тБрэндов</name>
    <attributes>
      <name>СекторХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Коллекция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Наборщик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоНабора</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеНабора</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемКоробов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>35</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборЗакончен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Сканировщик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоКомплектующие</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоБлочки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопОбработчик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияНакладной</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаспределения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоСканировки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСканировки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоДопОбработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеДопОбработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СканировкаЗакончена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДопОбработкаЗакончена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяТекущегоСостояния</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКоробок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБлочков</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоШтук</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтрок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Переукладчик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПереукладки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПереукладки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстановкаНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстановкаСканирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстановкаДопОбработки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоОстановкиНабора</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоОстановкиСканирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоОстановкиДопОбработки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СекторНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПаллетирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеПаллетирования</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПаллетированиеЗакончено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Паллетировщик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОшибок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНеверноНабранногоТовара</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачалоТермоусадки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеТермоусадки</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ТермоусадкаЗакончена</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Термоусадчик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧасти</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыводитьНаПечать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоКомплектации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеКомплектации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектовщик</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяФормированиеНабораЧЗ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДляНаборов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресноеХранение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разделенная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/РеквизитыСправочников/РеквизитыСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РеквизитыСправочников</name>
  <resources>
    <name>ЗначениеРеквизита</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Справочник</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяРеквизита</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ТипУзлаИБ/ТипУзлаИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипУзлаИБ</name>
  <enumValues>
    <name>ИнтегральнаяИБ</name>
  </enumValues>
  <enumValues>
    <name>УправляющееПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>ТорговоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>Филиал</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидСклада/ВидСклада.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСклада</name>
  <enumValues>
    <name>Физический</name>
  </enumValues>
  <enumValues>
    <name>Виртуальный</name>
  </enumValues>
  <enumValues>
    <name>ВиртуальныйДляСклада</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ПланНабора/ManagerModule.bsl
Функция ОткрытьСоздатьПланНабора(Накладная) Экспорт
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда Возврат Ложь КонецЕсли;	
	
	
	
	// Кухарь А.Ю. 23.06.2020 начало
	// ПланНабораСсылка=Документы.ПланНабора.НайтиПоРеквизиту("ДокОснование",Накладная);
	ПланНабораСсылка=Документы.ПланНабора.ПустаяСсылка();	
	Запрос=новый запрос;
	запрос.Текст= "ВЫБРАТЬ ПЕРВЫЕ 1
	              |	ПланНабора.Ссылка КАК Ссылка
	              |ИЗ
	              |	Документ.ПланНабора КАК ПланНабора
	              |ГДЕ
	              |	ПланНабора.ДокОснование = &ДокОснование
	              |	И НЕ ПланНабора.ПометкаУдаления
	              |	И ПланНабора.Дата > &Дата";
	запрос.УстановитьПараметр("ДокОснование",Накладная); 
	// Кухарь А.Ю. 11.08.2021 начало
	//Иногда дата накладной чуть больше даты плана набора
	//	запрос.УстановитьПараметр("Дата",Мин(Константы.ДатаЗапретаРедактирования.Получить(),накладная.дата));
	запрос.УстановитьПараметр("Дата",Мин(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования(),НачалоМесяца(накладная.дата))); 
	// Кухарь А.Ю. 11.08.2021 конец

	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл
		ПланНабораСсылка=результат.ссылка;
	КонецЦикла;
	// Кухарь А.Ю. 23.06.2020 конец
	
	
	ТолькоПросмотр=Ложь;
	Если ЕстьБлокировкаНоменклатуры(Накладная) Тогда
		Если ПланНабораСсылка.Пустая() Тогда
			Сообщить("В документе присутствует заблокированная для инвентаризации номенклатура! Создание плана набора запрещено !");
			Возврат Ложь;		
		Иначе
			ТолькоПросмотр=Истина;
			Сообщить("В документе присутствует заблокированная для инвентаризации номенклатура! Возможен только просмотр документа !");
		КонецЕсли;		
	КонецЕсли;		
	
	Если ПланНабораСсылка.Пустая() Тогда
		Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
			// Кухарь А.Ю. 19.02.2020 начало
			//  			Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом Тогда
			Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом и Накладная.склад.видсклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада  Тогда			 
				// Кухарь А.Ю. 19.02.2020 конец
				
				Сообщить("Планы набора можно создавать только в состоянии ""Получено складом"" !");
				Возврат Ложь;		
			КонецЕсли;		
		КонецЕсли;
		
		ПланНабораОбъект=Документы.ПланНабора.СоздатьДокумент();			
		ПланНабораОбъект.Заполнить(Накладная);
		
		// Кухарь А.Ю.  21.12.2022 начало
		// ПРМ сверху вниз, теперь требуются планы набора и ЗНБ
		если ТипЗнч(Накладная) =Тип("ДокументСсылка.Перемещение") тогда
			если Накладная.склад.видсклада=Перечисления.ВидСклада.ВиртуальныйДляСклада или   Накладная.СкладПолучатель.видсклада=Перечисления.ВидСклада.ВиртуальныйДляСклада  тогда
				ПланНабораОбъект.СозданоОбработкойПополнения=Истина;
			КонецЕсли;
		КонецЕсли;
		// Кухарь А.Ю.  21.12.2022 конец
		
		
		
	Иначе
		ПланНабораОбъект=ПланНабораСсылка.ПолучитьОбъект();
	КонецЕсли;		
	
	Форма=ПланНабораОбъект.ПолучитьФорму();
	Форма.ТолькоПросмотр=ТолькоПросмотр;
	Форма.Открыть();	
	
	Возврат Истина;
КонецФункции //ОткрытьСоздатьПланНабора(Накладная)

Функция СоздатьПланНабораАвтоРаспределение(Накладная) Экспорт
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда Возврат Ложь КонецЕсли;	
	Запрос=новый запрос;
	запрос.Текст=  "ВЫБРАТЬ
	|	ПланНабора.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПланНабора КАК ПланНабора
	|ГДЕ
	|	ПланНабора.ДокОснование = &ДокОснование
	|	И ПланНабора.Проведен
	|	И ПланНабора.Дата >= &Дата";	
	запрос.УстановитьПараметр("Дата",Накладная.дата-30*24*3600);	
	запрос.УстановитьПараметр("ДокОснование",Накладная);
	Результат=запрос.Выполнить().Выбрать();
	пока Результат.Следующий() цикл
		СообщитьИзМодуля("План набора уже есть");
		возврат Ложь;
	КонецЦикла;
	
	ТолькоПросмотр=Ложь;
	Если ЕстьБлокировкаНоменклатуры(Накладная) Тогда
		Сообщить("В документе присутствует заблокированная для инвентаризации номенклатура! Создание плана набора запрещено !");
		Возврат Ложь;			
	КонецЕсли;		
	
	
	Если ПараметрыСеанса.ЭтотУзел.ТипУзла = Перечисления.ТипУзлаИБ.Склад Тогда
		Если Накладная.СостояниеНакладной <> Перечисления.СостоянияНакладной.ПолученоСкладом и Накладная.склад.видсклада<>Перечисления.ВидСклада.ВиртуальныйДляСклада  Тогда			 
			Сообщить("Планы набора можно создавать только в состоянии ""Получено складом"" !");
			Возврат Ложь;		
		КонецЕсли;		
	КонецЕсли;
	
	ПланНабораОбъект=Документы.ПланНабора.СоздатьДокумент();			
	ПланНабораОбъект.Заполнить(Накладная);
	
	ПланНабораОбъект.АвтоматическиРазбитьПН_СформироватьЗНБ();
	
	Возврат Истина;
КонецФункции //ОткрытьСоздатьПланНабора(Накладная)

#Область СлужебныйНаборщик
Функция ЗаполнитьСлужебногоНаборщикаFBS(ТЗ_Брэндов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ_Брэндов", ТЗ_Брэндов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.СекторХранения КАК СТРОКА(10)) КАК Сектор,
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.Брэнд КАК Справочник.Номенклатура) КАК Брэнд,
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.Коллекция КАК Справочник.Номенклатура) КАК Коллекция,
	|	ВЫРАЗИТЬ(ТЗ_Брэндов.Наборщик КАК Справочник.ФизическиеЛица) КАК Наборщик
	|ПОМЕСТИТЬ вр_Брэнды
	|ИЗ
	|	&ТЗ_Брэндов КАК ТЗ_Брэндов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр_Брэнды.Сектор КАК Сектор,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК СекторХранения,
	|	вр_Брэнды.Брэнд КАК Брэнд,
	|	вр_Брэнды.Коллекция КАК Коллекция,
	|	вр_Брэнды.Наборщик КАК НаборщикИзДокумента
	|ПОМЕСТИТЬ тз_Сектора
	|ИЗ
	|	вр_Брэнды КАК вр_Брэнды
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|		ПО (вр_Брэнды.Брэнд = РеквизитыСправочников.Справочник
	|				ИЛИ вр_Брэнды.Коллекция = РеквизитыСправочников.Справочник)
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = ""СекторНоменклатуры""
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.Справочник) = ТИП(Справочник.Номенклатура)
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.ЗначениеРеквизита) = ТИП(Справочник.СектораХранения)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тз_Сектора.Сектор КАК Сектор,
	|	тз_Сектора.СекторХранения КАК СекторХранения,
	|	тз_Сектора.Брэнд КАК Брэнд,
	|	тз_Сектора.Коллекция КАК Коллекция,
	|	тз_Сектора.НаборщикИзДокумента КАК НаборщикИзДокумента,
	|	РеквизитыСправочников.ЗначениеРеквизита КАК СлужебныйНаборщик
	|ИЗ
	|	тз_Сектора КАК тз_Сектора
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСправочников КАК РеквизитыСправочников
	|		ПО тз_Сектора.СекторХранения = РеквизитыСправочников.Справочник
	|ГДЕ
	|	РеквизитыСправочников.ИмяРеквизита = ""СлужебныйНаборщик""
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.Справочник) = ТИП(Справочник.СектораХранения)
	|	И ТИПЗНАЧЕНИЯ(РеквизитыСправочников.ЗначениеРеквизита) = ТИП(Справочник.ФизическиеЛица)";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ_Наборщики = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТЗ_Наборщики;
	
КонецФункции
#КонецОбласти 

//++Ратманов 24.03.2026
Процедура ЗаписатьВремяСканирования(ПараметрыВыполнения) Экспорт
КонецПроцедуры
